package org.patriot;

import org.patriot.lib.rcon.Server;
import org.patriot.lib.rcon.privilege.Price;
import org.patriot.lib.rcon.privilege.Privilege;

public interface Constants {
    //database
    String db_ip = "94.131.96.224";
    String db_username = "bebra";
    String db_password = "gegra";
    int db_port = 3306;
    String db_name = "mydatabase";

    String BOT_TOKEN = "MTAyMjE3MzAzOTk0MjY5NzA1Ng.GCD581.-JyA92C0f9jdp3dZvNJ5Ssc-ZeR1S9pRwbLp6k";
    String PREFIX = "p.";

    //Else ids
    String GUILD_ID = "962278435844157460";


    //Channel ids
    String LOGGING_CHANNEL_ID = "1120452442765660212";
    String TEXNICAL_SUPPORT_CATEGORY_ID = "1078396704316981282";
    String TELEGRAM_VIP_CATEGORY_ID = "1041669866089873408";
    String LOOKING_FOR_STUFF_CATEGORY_ID = "1042104584077844521";
    String ISSUES_CHANNEL_ID = "978619277802348584";


    //Role ids
    String SUPPORTERS_ROLE_ID = "979439633446350928";
    String MIRAGE_1 = "1041067783083008121";
    String MIRAGE_2 = "1041079007250239488";
    String MIRAGE_3 = "1077242519076741170";
    String MIRAGE_4 = "1077242520137912450";
    String MIRAGE_5 = "1077242521320685698";
    String AWP_1 = "1041076181279195268";
    String AWP_2 = "1041078306826629231";
    String AWP_3 = "1041078733773230210";
    String AWP_4 = "1041078885980327967";
    String AWP_5 = "1075316747206410262";
    String PUBLIC_1 = "1041077684987510855";
    String BOOSTER_ROLE_ID = "972255400462266400";
    String TWITCH_ROLE_ID = "1108846579730894949";

    String VALORANT_ROLE_ID = "981827029282471976";
    String CSGO_ROLE_ID = "981812083404447776";
    String BRAWL_STARS_ROLE_ID = "1042731366896386068";
    String DOTA_ROLE_ID = "981812092623532063";
    String GENSHIN_ROLE_ID = "981812086676004894";
    String LEGUE_OF_LEGUENDS_ROLE_ID = "1042752993260482590";
    String BRAWHALA_ROLE_ID = "1042752572974440468";

    //Fondy api
    String MERCHANT_ID = "1521980";
    String SIGNATURE_PROTECTOR = "DnRrMQcV2mej6mp8Bx4piIvdBgf4SAFF";

    //Steam api
    String STEAM_API_KEY = "F607B11B33275A5BE7930779D56A1EF6";

    //Csgo rcon
    Server awp_1 = Server.builder().name("Awp 1").ip("91.211.118.131").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server awp_2 = Server.builder().name("Awp 2").ip("91.200.42.111").port(27016).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server awp_3 = Server.builder().name("Awp 3").ip("91.200.42.111").port(27017).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server awp_4 = Server.builder().name("Awp 4").ip("91.200.42.111").port(27018).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server awp_5 = Server.builder().name("Awp 5").ip("91.200.42.111").port(27018).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server mirage_1 = Server.builder().name("Mirage 1").ip("91.211.118.127").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server mirage_2 = Server.builder().name("Mirage 2").ip("91.200.42.111").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server mirage_3 = Server.builder().name("Mirage 3").ip("91.211.118.134").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server mirage_4 = Server.builder().name("Mirage 4").ip("91.211.118.132").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server mirage_5 = Server.builder().name("Mirage 5").ip("91.211.118.114").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();
    Server _public = Server.builder().name("Украинский-паблик").ip("91.211.118.135").port(27015).pass("1Ktp2ZnEW17UJ7Z1UzNP").build();

    //Privileges
    Privilege bhop = Privilege.builder()
            .name("Банихоп")
            .group("[Bhop]")
            .roleId("?")
            .imageUrl("https://cdn.discordapp.com/attachments/963699910501367848/1037695707060121600/Typography_49.gif")
            .description("```py\n#Характеристики:``` ```▫ Баннихоп\n" +
                    "▫ Тег в чате\\табе \"Банихоп\"```")
            .price(new Price(20,30,70))
            .build();
    Privilege vip = Privilege.builder()
            .name("Вип")
            .group("[Vip]")
            .roleId("?")
            .imageUrl("https://cdn.discordapp.com/attachments/963699910501367848/1037695727071137832/2ad6da774c34c9e3.gif")
            .description("```py\n#Характеристики:``` ```▫ Тег чате\\табе \"Вип\"\n" +
                    "▫ Банихоп (после 5 секунд начала раудна)\n" +
                    "▫ Ускорение на лестницах\n" +
                    "▫ Смена набора оружия через вип панель\n" +
                    "▫ Имуните 10 уровень\n" +
                    "▫ Разноцветный экран при убийстве\n" +
                    "▫ Доступны скины на агентов\n" +
                    "▫ Доступны медальки для таба\n" +
                    "▫ Метательный нож - количество: 1\n" +
                    "▫ Шприц в начале раунда -  количество: 1\n" +
                    "▫ При смерти електро-еффект\n" +
                    "▫ Водный еффект при убийстве\n" +
                    "▫ Показ урона\n" +
                    "▫ Выносливость\n" +
                    "▫ Растворение после смерти\n" +
                    "▫ Треилы\n" +
                    "▫ Звук при убийстве\n" +
                    "▫ Антифлеш (от себя)\n" +
                    "▫ Подсветка оружия\n" +
                    "▫ Скайбоксы\n" +
                    "\n" +
                    "❖ Инструкция по использованию вип панели```")
            .price(new Price(50, 80, 160))
            .build();
    Privilege premium = Privilege.builder()
            .name("Премиум")
            .group("[Premium]")
            .roleId("?")
            .imageUrl("https://cdn.discordapp.com/attachments/963699910501367848/1037695729629667358/premium.gif")
            .description("```py\n#Характеристики:``` ```▫ Тег чате\\табе \"Премиум\"\n" +
                    "▫ Банихоп (после 5 секунд начала раудна)\n" +
                    "▫ Ускорение на лестницах\n" +
                    "▫ Смена набора оружия через вип панель\n" +
                    "▫ Имуните 40 уровень\n" +
                    "▫ Разноцветный экран при убийстве\n" +
                    "▫ Доступны скины на агентов\n" +
                    "▫ Доступны медальки для таба\n" +
                    "▫ Метательный нож - количество: 1\n" +
                    "▫ Шприц в начале раунда -  количество: 1\n" +
                    "▫ При смерти електро-еффект\n" +
                    "▫ Водный еффект при убийстве\n" +
                    "▫ Показ урона\n" +
                    "▫ Выносливость\n" +
                    "▫ Растворение после смерти\n" +
                    "▫ Набор гранат\n" +
                    "▫ Треилы\n" +
                    "▫ Звук при убийстве\n" +
                    "▫ Антифлеш (от себя и комадны) \n" +
                    "▫ Подсветка оружия\n" +
                    "▫ Скайбоксы\n" +
                    "▫ Заработок кредитов Shop: x2\n" +
                    "▫ Расширенная обойма\n" +
                    "▫ Быстрая перезарядка\n" +
                    "▫ Цветной чат (кастомный)\n" +
                    "▫  Автоустановка Оружия\n" +
                    "▫ Замена Оружия без патронов\n" +
                    "▫ Множитель опыта\n" +
                    "▫ 105 хп \\ 105 брони\n" +
                    "▫ Убить игрока\n" +
                    "▫ Забанить игрока\n" +
                    "▫ Переместить игрока\n" +
                    "▫ Неведимка в спектарах\n" +
                    "▫ Вх в наблюдателях\n" +
                    "▫ Отдельная Роль в Дискорде\n" +
                    "▫ Резервный слот на сервере\n" +
                    "▫ Доступ к командам !msay!csay!tsay\n" +
                    "▫ Доступ к голосованиям\n" +
                    "▫ Доступ на резервный слот\n" +
                    "▫ Шлепнуть игрока\n" +
                    "▫ Поджеч игрока\n" +
                    "▫ Поставить маяк на игрока\n" +
                    "▫ Заморозить игрока\n" +
                    "▫ Часовая бомба\n" +
                    "▫ Ослепить \\ опьянить игрока\n" +
                    "▫ Инструменты с DangerZone\n" +
                    "▫ Выбор кастомных рангов\n" +
                    "\n" +
                    "❖ Инструкция по использованию вип\\админ панели```")
            .price(new Price(150, 200, 400))
            .build();
    Privilege admin = Privilege.builder()
            .name("Админ")
            .group("[Admin]")
            .roleId("?")
            .imageUrl("https://cdn.discordapp.com/attachments/963699910501367848/1037695727461212180/admin.gif")
            .description("```py\n#Характеристики:``` ```▫ Тег чате\\табе \"Премиум\"\n" +
                    "▫ Банихоп (после 5 секунд начала раудна)\n" +
                    "▫ Ускорение на лестницах\n" +
                    "▫ Смена набора оружия через вип панель\n" +
                    "▫ Имуните 50 уровень\n" +
                    "▫ Разноцветный экран при убийстве\n" +
                    "▫ Доступны скины на агентов\n" +
                    "▫ Доступны медальки для таба\n" +
                    "▫ Метательный нож - количество: 1\n" +
                    "▫ Шприц в начале раунда -  количество: 1\n" +
                    "▫ При смерти електро-еффект\n" +
                    "▫ Водный еффект при убийстве\n" +
                    "▫ Показ урона\n" +
                    "▫ Выносливость\n" +
                    "▫ Растворение после смерти\n" +
                    "▫ Треилы\n" +
                    "▫ Звук при убийстве\n" +
                    "▫ Антифлеш (от себя и комадны) \n" +
                    "▫ Подсветка оружия\n" +
                    "▫ Скайбоксы\n" +
                    "▫ Заработок кредитов Shop: x2\n" +
                    "▫ Расширенная обойма\n" +
                    "▫ Цветной чат (кастомный)\n" +
                    "▫  Автоустановка Оружия\n" +
                    "▫ Замена Оружия без патронов\n" +
                    "▫ Множитель опыта\n" +
                    "▫ 105 хп \\ 105 брони\n" +
                    "▫ Убить игрока\n" +
                    "▫ Забанить игрока\n" +
                    "▫ Замутить игрока\n" +
                    "▫ Кикнуть игрока\n" +
                    "▫ Разбанить игрока\n" +
                    "▫ Набор гранат\n" +
                    "▫ Размутить\n" +
                    "▫ Стартрекбуст 3000 киллов\n" +
                    "▫ Переместить игрока\n" +
                    "▫ Неведимка в спектарах\n" +
                    "▫ Вх в наблюдателях\n" +
                    "▫ Отдельная Роль в Дискорде\n" +
                    "▫ Резервный слот на сервере\n" +
                    "▫ Доступ к командам !msay!csay!tsay\n" +
                    "▫ Доступ к голосованиям\n" +
                    "▫ Шлепнуть игрока\n" +
                    "\n" +
                    "❖ Инструкция по использованию админ панели```")
            .price(new Price(100, 150, 300))
            .build();
    Privilege mainAdmin = Privilege.builder()
            .name("Главный-Админ")
            .group("[Gladmin]")
            .roleId("?")
            .imageUrl("https://cdn.discordapp.com/attachments/963699910501367848/1037695728702726225/gladmin.gif")
            .description("```py\n#Характеристики:``` ```▫ Тег чате\\табе \"Гл.Админ\"\n" +
                    "▫ Банихоп (после 5 секунд начала раудна)\n" +
                    "▫ Ускорение на лестницах\n" +
                    "▫ Смена набора оружия через вип панель\n" +
                    "▫ Имуните 70 уровеня\n" +
                    "▫ Разноцветный экран при убийстве\n" +
                    "▫ Доступны скины на агентов\n" +
                    "▫ Доступны медальки для таба\n" +
                    "▫ Метательный нож - количество: 1\n" +
                    "▫ Шприц в начале раунда -  количество: 1\n" +
                    "▫ При смерти електро-еффект\n" +
                    "▫ Водный еффект при убийстве\n" +
                    "▫ Показ урона\n" +
                    "▫ Выносливость\n" +
                    "▫ Набор гранат\n" +
                    "▫ Растворение после смерти\n" +
                    "▫ Треилы\n" +
                    "▫ Звук при убийстве\n" +
                    "▫ Антифлеш (от себя и комадны) \n" +
                    "▫ Подсветка оружия\n" +
                    "▫ Скайбоксы\n" +
                    "▫ Заработок кредитов Shop: x2\n" +
                    "▫ Расширенная обойма\n" +
                    "▫ Цветной чат (кастомный)\n" +
                    "▫  Автоустановка Оружия\n" +
                    "▫ Замена Оружия без патронов\n" +
                    "▫ Множитель опыта\n" +
                    "▫ 105 хп \\ 105 брони\n" +
                    "▫ Убить игрока\n" +
                    "▫ Забанить игрока\n" +
                    "▫ Замутить игрока\n" +
                    "▫ Кикнуть игрока\n" +
                    "▫ Разбанить игрока\n" +
                    "▫ Размутить\n" +
                    "▫ Стартрекбуст 3000 киллов\n" +
                    "▫ Переместить игрока\n" +
                    "▫ Неведимка в спектарах\n" +
                    "▫ Вх в наблюдателях\n" +
                    "▫ Быстрая перезарядка\n" +
                    "▫ Отдельная Роль в Дискорде\n" +
                    "▫ Резервный слот на сервере\n" +
                    "▫ Доступ к командам !msay!csay!tsay\n" +
                    "▫ Доступ к голосованиям\n" +
                    "▫ Шлепнуть игрока\n" +
                    "▫ Инструменты с DangerZone\n" +
                    "▫ Выбор кастомных рангов\n" +
                    "\n" +
                    "❖ Инструкция по использованию админ панели```")
            .price(new Price(250, 300, 600))
            .build();
    Privilege moderator = Privilege.builder()
            .name("Модератор")
            .group("[Moderator]")
            .roleId("?")
            .imageUrl("https://cdn.discordapp.com/attachments/963699910501367848/1037695729180868698/moder.gif")
            .description("```py\n#Характеристики:``` ```▫ Тег чате\\табе \"Кастомный\"\n" +
                    "▫ Банихоп \n" +
                    "▫ Ускорение на лестницах\n" +
                    "▫ Смена набора оружия через вип панель\n" +
                    "▫ Имуните 80 уровень\n" +
                    "▫ Разноцветный экран при убийстве\n" +
                    "▫ Доступны скины на агентов\n" +
                    "▫ Доступны медальки для таба\n" +
                    "▫ Метательный нож - количество: 1\n" +
                    "▫ Шприц в начале раунда -  количество: 1\n" +
                    "▫ При смерти електро-еффект\n" +
                    "▫ Водный еффект при убийстве\n" +
                    "▫ Показ урона\n" +
                    "▫ Выносливость\n" +
                    "▫ Растворение после смерти\n" +
                    "▫ Треилы\n" +
                    "▫ Звук при убийстве\n" +
                    "▫ Антифлеш (от себя и комадны) \n" +
                    "▫ Подсветка оружия\n" +
                    "▫ Скайбоксы\n" +
                    "▫ Заработок кредитов Shop: x2\n" +
                    "▫ Расширенная обойма\n" +
                    "▫ Цветной чат (кастомный)\n" +
                    "▫ Автоустановка Оружия\n" +
                    "▫ Замена Оружия без патронов\n" +
                    "▫ Множитель опыта\n" +
                    "▫ 110 хп \\ 125 брони\n" +
                    "▫ Убить игрока\n" +
                    "▫ Забанить игрока\n" +
                    "▫ Замутить игрока\n" +
                    "▫ Кикнуть игрока\n" +
                    "▫ Разбанить игрока\n" +
                    "▫ Размутить\n" +
                    "▫ Стартрекбуст 10000 киллов\n" +
                    "▫ Переместить игрока\n" +
                    "▫ Неведимка в спектарах\n" +
                    "▫ Вх в наблюдателях\n" +
                    "▫ Отдельная Роль в Дискорде\n" +
                    "▫ Резервный слот на сервере\n" +
                    "▫ Доступ к командам !msay!csay!tsay\n" +
                    "▫ Доступ к голосованиям\n" +
                    "▫ Шлепнуть игрока\n" +
                    "▫ Модели гранат\n" +
                    "▫ Набор гранат\n" +
                    "▫ Инструменты с DangerZone\n" +
                    "▫ Трейлы гранат\n" +
                    "▫ Оффлайн бан\n" +
                    "▫ Звук убийства игрока\n" +
                    "▫ Быстрая установка бомбы\n" +
                    "▫ Быстрая перезарядка\n" +
                    "▫ Растворение тела\n" +
                    "▫ Выдача привилегий друзьям\n" +
                    "▫ Выдача кредитов себе\n" +
                    "▫ Доступ к командам !msay!csay!tsay\n" +
                    "▫ Ускоренная карьерная лестница\n" +
                    "▫ Команда сервера\n" +
                    "▫ Выбор кастомных рангов\n" +
                    "▫ Количество MVP можно изменить\n" +
                    "▫ Радужная модель игрока\n" +
                    "\n" +
                    "❖ Инструкция по использованию админ панели```")
            .price(new Price(450 , 550, 1000))
            .build();
}
